app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Rooney"], ["last_name", "Mara"], ["created_at", "2020-10-07 22:38:44.334145"], ["updated_at", "2020-10-07 22:38:44.334145"]]
---
	def create
		student = Student.new(student_params(:first_name, :last_name))
		student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "T"], ["updated_at", "2020-10-07 22:52:26.814711"], ["id", 3]]
---
	def update
		student = Student.find(params[:id])
		student.update(student_params(:first_name, :last_name))